# さらば学歴？　エンジニア採用の動向

学歴ではなくスキルで人材を確保したいー
日本ではコロナ後にこう考える経営者が増えている。

## 中小企業の嘆き
筆者がお会いした中小企業の経営者は、「DX化に対応しきれない」「うちにはDX人材がいない」といった悩みを聞くことがあった。続けて「アイデアはあるんだけどねぇ」と嘆いていた。

一方でIT系企業をはじめ、すでにDXの準備を整えていた企業には追い風が吹いている。大手保険会社の支店長は「お客様がオンライン商談に抵抗がなくなったことで、営業コストがぐっと下がった。商材をAIがおすすめするシステムも好評」と力を込める。

## スキル人材を狙うには？
2023年4月14日付けの日本経済新聞には、スキル採用の例としてサイバーエージェント（以下、CA）を紹介している。CAでは来春入社予定者として、高校中退から42Tokyoを経た蔀綾人さんを採用した。

蔀さんが通学していた42Tokyoは、母体のフランスでは教育機関として認められ、世界中に支部が広がっている。1年半ほどの基礎課程ではC言語やLinuxを中心とした堅実な課題をクリアしていく。

42Tokyoのユニークな点は、教師がおらず、学生たちが協力し合う「ピアラーニング」を採用していること。六本木の高層ビルに設けられた教室は、24時間365日開かれている。そして、エンジニア経験のない人たちにも門下が開かれていることだ。

ただし、4週間の入学試験「ピシン」は相当にハード。運営スタッフに話を伺ったところ、「合格者の特徴は、1日12時間ほどコードに向き合い続けている人たち」。さらにメンバー間でのコミュニケーションも重視される。入学後も、1日5時間以上の学習が必要。規定より学習が遅れた場合は、退校の憂き目にあう。

蔀さんのように、十分なハード／ソフトスキルを兼ね備えた人材が、スキル採用を突破する。

## いま、私たちは何をすべきか
スキル人材を狙うのであれば、”正しい自己研鑽”が必要だ。
キャリアの目標を明確化し、寄り道のないロードマップを描くことが得策と考える。

学習方法に関しては個人差がある。書籍や動画の自己学習でメキメキ力をつける者もいれば、42Tokyoのような学習機関に属する方が早く成長する者もいる。そのほかにメンターの利用、学習プロジェクトやセミナー、小規模な案件を獲得して学びながらお金を得る、といった選択肢が数多ある。

ブレない学習を続けるため、時には第三者の意見も大切。現役エンジニアや採用担当者とおしゃべりして、自分を鼓舞しよう。

いまの学びが、未来の自分に繋がっている。
